tdloe/tms320-rpi-serial/inc/hw_can.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF2DATB register
//
//*****************************************************************************
#define CAN_IF2DATB_DATA_4_S      0U
#define CAN_IF2DATB_DATA_4_M      0xFFU        // Data Byte 4
#define CAN_IF2DATB_DATA_5_S      8U
#define CAN_IF2DATB_DATA_5_M      0xFF00U      // Data Byte 5
#define CAN_IF2DATB_DATA_6_S      16U
#define CAN_IF2DATB_DATA_6_M      0xFF0000U    // Data Byte 6
#define CAN_IF2DATB_DATA_7_S      24U
#define CAN_IF2DATB_DATA_7_M      0xFF000000U  // Data Byte 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3OBS register
//
//*****************************************************************************
#define CAN_IF3OBS_MASK           0x1U         // Mask data read observation
#define CAN_IF3OBS_ARB            0x2U         // Arbitration data read
                                               // observation
#define CAN_IF3OBS_CTRL           0x4U         // Ctrl read observation
#define CAN_IF3OBS_DATA_A         0x8U         // Data A read observation
#define CAN_IF3OBS_DATA_B         0x10U        // Data B read observation
#define CAN_IF3OBS_IF3SM          0x100U       // IF3 Status of Mask data read
                                               // access
#define CAN_IF3OBS_IF3SA          0x200U       // IF3 Status of Arbitration
                                               // data read access
#define CAN_IF3OBS_IF3SC          0x400U       // IF3 Status of Control bits
                                               // read access
#define CAN_IF3OBS_IF3SDA         0x800U       // IF3 Status of Data A read
                                               // access
#define CAN_IF3OBS_IF3SDB         0x1000U      // IF3 Status of Data B read
                                               // access
#define CAN_IF3OBS_IF3UPD         0x8000U      // IF3 Update Data

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3MSK register
//
//*****************************************************************************
#define CAN_IF3MSK_MSK_S          0U
#define CAN_IF3MSK_MSK_M          0x1FFFFFFFU  // Mask
#define CAN_IF3MSK_MDIR           0x40000000U  // Mask Message Direction
#define CAN_IF3MSK_MXTD           0x80000000U  // Mask Extended Identifier

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3ARB register
//
//*****************************************************************************
#define CAN_IF3ARB_ID_S           0U
#define CAN_IF3ARB_ID_M           0x1FFFFFFFU  // Message  Identifier
#define CAN_IF3ARB_DIR            0x20000000U  // Message Direction
#define CAN_IF3ARB_XTD            0x40000000U  // Extended Identifier
#define CAN_IF3ARB_MSGVAL         0x80000000U  // Message Valid

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3MCTL register
//
//*****************************************************************************
#define CAN_IF3MCTL_DLC_S         0U
#define CAN_IF3MCTL_DLC_M         0xFU         // Data length code
#define CAN_IF3MCTL_EOB           0x80U        // End of Block
#define CAN_IF3MCTL_TXRQST        0x100U       // Transmit Request
#define CAN_IF3MCTL_RMTEN         0x200U       // Remote Enable
#define CAN_IF3MCTL_RXIE          0x400U       // Receive Interrupt Enable
#define CAN_IF3MCTL_TXIE          0x800U       // Transmit Interrupt Enable
#define CAN_IF3MCTL_UMASK         0x1000U      // Use Acceptance Mask
#define CAN_IF3MCTL_INTPND        0x2000U      // Interrupt Pending
#define CAN_IF3MCTL_MSGLST        0x4000U      // Message Lost
#define CAN_IF3MCTL_NEWDAT        0x8000U      // New Data

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3DATA register
//
//*****************************************************************************
#define CAN_IF3DATA_DATA_0_S      0U
#define CAN_IF3DATA_DATA_0_M      0xFFU        // Data Byte 0
#define CAN_IF3DATA_DATA_1_S      8U
#define CAN_IF3DATA_DATA_1_M      0xFF00U      // Data Byte 1
#define CAN_IF3DATA_DATA_2_S      16U
#define CAN_IF3DATA_DATA_2_M      0xFF0000U    // Data Byte 2
#define CAN_IF3DATA_DATA_3_S      24U
#define CAN_IF3DATA_DATA_3_M      0xFF000000U  // Data Byte 3

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_IF3DATB register
//
//*****************************************************************************
#define CAN_IF3DATB_DATA_4_S      0U
#define CAN_IF3DATB_DATA_4_M      0xFFU        // Data Byte 4
#define CAN_IF3DATB_DATA_5_S      8U
#define CAN_IF3DATB_DATA_5_M      0xFF00U      // Data Byte 5
#define CAN_IF3DATB_DATA_6_S      16U
#define CAN_IF3DATB_DATA_6_M      0xFF0000U    // Data Byte 6
#define CAN_IF3DATB_DATA_7_S      24U
#define CAN_IF3DATB_DATA_7_M      0xFF000000U  // Data Byte 7
#endif
